Repository: tonjo/charisma-mvc
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: it_it

source: ERROR opening database
it_it: ERRORE nell'apertura del database

source: Only sqlite type DB supported (for onefilephplogin)
it_it: Solo DB di tipo sqlite sono supportati (per onefilephplogin)

source: Error, log table not present or corrupt
it_it: Errore, tabella log inesistente o corrotta

source: Username field was empty.
it_it: Il campo Username è vuoto.

source: Password field was empty.
it_it: Il campo Password è vuoto.

source: Users table nonexistent or corrupt
it_it: Tabella users inesistente o corrotta

source: Wrong password.
it_it: Password errata.

source: This user does not exist.
it_it: Utente inesistente.

source: User not allowed to login from this network
it_it: Utente non autorizzato a collegarsi da questa rete

source: Impossible to record log, invalid or nonexistent log table
it_it: Impossibile registrare i log, tabella log inesistente o corrotta

source: Empty Username
it_it: Username vuoto

source: Empty Password
it_it: Password vuota

source: Password and password repeat are not the same
it_it: Password e Ripeti password non sono uguali

source: Password has a minimum length of 6 characters
it_it: La password deve avere almeno 6 caratteri

source: Username cannot be shorter than 2 or longer than 64 characters
it_it: Username deve avere una lunghezza compresa tra 2 e 64 caratteri

source: Username does not fit the name scheme: only a-Z and numbers are allowed, 2 to 64 characters
it_it: Username non valido: solo lettere a-Z e numeri, da 2 a 64 caratteri totali

source: Email cannot be empty
it_it: Email non può essere vuota

source: Email cannot be longer than 64 characters
it_it: Email deve avere una lunghezza massima di 64 caratteri

source: Your email address is not in a valid email format
it_it: Indirizzo email in formato non valido

source: An unknown error occurred.
it_it: Errore generico

source: Sorry, that username / email is already taken. Please choose another one.
it_it: Spiacente, username o email già usato.

source: Your account has been created successfully. You can now log in.
it_it: Il tuo account è stato creato. Puoi effettuare il login.

source: Sorry, your registration failed.
it_it: Spiacente, la tua registrazione è fallita.

source: Password must be at least 6 characters long
it_it: La Password deve avere almeno 6 caratteri
